{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Compare TFIDF output from networkx with neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import ast\n",
    "import logging\n",
    "import os\n",
    "import pickle\n",
    "import random\n",
    "\n",
    "import pandas as pd\n",
    "import pyvis\n",
    "from dotenv import load_dotenv\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Networkx visualisation using pyvis"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "EMBEDDING_MODEL = \"tfidf_cosine\"\n",
    "\n",
    "INPUT_GRAPH_PATH = os.path.join(\n",
    "    \"..\",\n",
    "    \"artifacts\",\n",
    "    \"outputs\",\n",
    "    EMBEDDING_MODEL + \"_graph\",\n",
    ")\n",
    "\n",
    "INPUT_CSV_PATH = os.path.join(\n",
    "    \"..\",\n",
    "    \"artifacts\",\n",
    "    \"outputs\",\n",
    "    f\"{EMBEDDING_MODEL}_graph_louvain_cluster.csv\",\n",
    ")\n",
    "\n",
    "graph = pickle.load(open(INPUT_GRAPH_PATH, \"rb\"))\n",
    "pred_df = pd.read_csv(INPUT_CSV_PATH)\n",
    "THRESHOLD = graph.graph[\"threshold\"]  # To be used by neo4j as the THRESHOLD similarity"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "networkx_network_tfidf_1.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"600px\"\n",
       "            src=\"networkx_network_tfidf_1.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x27129d0f0d0>"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Add page title attribute to nodes\n",
    "\n",
    "cluster_counts = pred_df[\"cluster_label\"].value_counts()\n",
    "\n",
    "# Filter cluster_labels with count greater than 1\n",
    "valid_clusters = cluster_counts[cluster_counts > 1].index\n",
    "\n",
    "# Update cluster_label column\n",
    "pred_df.loc[~pred_df[\"cluster_label\"].isin(valid_clusters), \"cluster_label\"] = pd.NA\n",
    "\n",
    "random.seed(123)\n",
    "node_cluster = [id for id in pred_df[\"cluster_label\"].unique() if str(id) != \"nan\"]\n",
    "\n",
    "cluster_colors = {}\n",
    "for cluster_id in set(node_cluster):\n",
    "    color = (random.randint(0, 255), random.randint(0, 255), random.randint(0, 255))\n",
    "    hex_color = \"#%02x%02x%02x\" % color\n",
    "    cluster_colors[str(cluster_id)] = hex_color\n",
    "\n",
    "for node, data in graph.nodes(data=True):\n",
    "    node_title = data[\"Page Title\"]\n",
    "    node_ground_truth = data[\"Combine Group ID\"]\n",
    "\n",
    "    # Find the corresponding row in pred_df\n",
    "    matching_row = pred_df[pred_df[\"Page Title\"] == node_title]\n",
    "\n",
    "    # If a matching row is found, update the node's attribute\n",
    "    if not matching_row.empty:\n",
    "        predicted_cluster = matching_row[\"cluster_label\"].values[0]\n",
    "        data[\"color\"] = cluster_colors.get(str(predicted_cluster), \"gray\")\n",
    "        data[\"Predicted Cluster\"] = predicted_cluster\n",
    "        hover_text = f\"Page Title: {node_title}\\nGround Truth: {str(node_ground_truth)}\\nPredicted Cluster: {str(predicted_cluster)}\"\n",
    "        data[\"title\"] = hover_text\n",
    "\n",
    "g = pyvis.network.Network(notebook=True, select_menu=True, filter_menu=True)\n",
    "g.from_nx(graph)\n",
    "g.show(\"networkx_network_tfidf_1.html\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connect to neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = \"neo4j://localhost:7687\"\n",
    "username = os.getenv(\"neo4j_username\")\n",
    "password = os.getenv(\"neo4j_password\")\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J = {\n",
    "    \"uri\": uri,\n",
    "    \"auth\": (username, password),\n",
    "    \"database\": \"tfidf\",  # create this database in neo4j first\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "dict_keys(['id', 'title', 'content', 'meta_description', 'vector', 'ground_truth_label'])"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "with open(\"articles.pkl\", \"rb\") as f:\n",
    "    articles = pickle.load(f)\n",
    "\n",
    "articles[\"vector\"] = articles[\"vector\"].apply(ast.literal_eval)\n",
    "\n",
    "documents = articles.to_dict(orient=\"records\")\n",
    "documents[0].keys()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "logging.basicConfig(level=logging.INFO)\n",
    "\n",
    "\n",
    "def clear_db(tx):\n",
    "    logging.info(\"Clearing database\")\n",
    "    tx.run(\"MATCH (n) DETACH DELETE n\")\n",
    "\n",
    "\n",
    "def create_graph_nodes(tx, doc):\n",
    "    # logging.info(\"Create nodes\")\n",
    "    tx.run(\n",
    "        \"\"\"\n",
    "    CREATE (d:Article {\n",
    "        id: $id,\n",
    "        title: $title, \n",
    "        content: $content, \n",
    "        meta_desc: $meta_description,\n",
    "        vector: $vector,\n",
    "        ground_truth: $ground_truth\n",
    "    })\"\"\",\n",
    "        id=doc[\"id\"],\n",
    "        title=doc[\"title\"],\n",
    "        content=doc[\"content\"],\n",
    "        meta_description=doc[\"meta_description\"],\n",
    "        vector=doc[\"vector\"],\n",
    "        ground_truth=doc[\"ground_truth_label\"],\n",
    "    )\n",
    "\n",
    "\n",
    "def create_sim_edges(tx, threshold):\n",
    "    logging.info(\"Create edges\")\n",
    "    result = tx.run(\n",
    "        \"\"\"\n",
    "    MATCH (a:Article), (b:Article)\n",
    "    WHERE a.id < b.id\n",
    "    WITH a, b, gds.similarity.cosine(a.vector, b.vector) AS similarity\n",
    "    WHERE similarity > $threshold\n",
    "    CREATE (a)-[:SIMILAR {similarity: similarity}]->(b)\n",
    "    \"\"\",\n",
    "        threshold=threshold,\n",
    "    )\n",
    "\n",
    "\n",
    "def create_graph_proj(tx):\n",
    "    # logging.info(\"Create projection\")\n",
    "    tx.run(\n",
    "        \"\"\"\n",
    "           CALL gds.graph.project(\n",
    "            'articleGraph',\n",
    "            'Article',\n",
    "            {\n",
    "                SIMILAR: {\n",
    "                    properties: 'similarity'\n",
    "                }\n",
    "            }\n",
    "           )\n",
    "    \"\"\"\n",
    "    )\n",
    "\n",
    "\n",
    "def detect_community(tx):\n",
    "    # logging.info(\"Detect community\")\n",
    "    tx.run(\n",
    "        \"\"\"\n",
    "        CALL gds.louvain.write(\n",
    "        'articleGraph',\n",
    "        {\n",
    "            writeProperty: 'community'\n",
    "        }\n",
    "        )\n",
    "    \"\"\"\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "INFO:root:Clearing database\n",
      "INFO:root:Create edges\n",
      "INFO:neo4j.notifications:Received notification from DBMS server: {severity: INFORMATION} {code: Neo.ClientNotification.Statement.CartesianProduct} {category: PERFORMANCE} {title: This query builds a cartesian product between disconnected patterns.} {description: If a part of a query contains multiple disconnected patterns, this will build a cartesian product between all those parts. This may produce a large amount of data and slow down query processing. While occasionally intended, it may often be possible to reformulate the query that avoids the use of this cross product, perhaps by adding a relationship between the different parts or by using OPTIONAL MATCH (identifier is: (b))} {position: line: 2, column: 1, offset: 5} for query: '\\n    MATCH (a:Article), (b:Article)\\n    WHERE a.id < b.id\\n    WITH a, b, gds.similarity.cosine(a.vector, b.vector) AS similarity\\n    WHERE similarity > $threshold\\n    CREATE (a)-[:SIMILAR {similarity: similarity}]->(b)\\n    '\n"
     ]
    }
   ],
   "source": [
    "with GraphDatabase.driver(**NEO4J) as driver:\n",
    "    with driver.session() as session:\n",
    "        session.execute_write(clear_db)  # Clear the database\n",
    "        for doc in documents:\n",
    "            session.execute_write(create_graph_nodes, doc)\n",
    "        session.execute_write(create_sim_edges, THRESHOLD)\n",
    "        session.execute_write(create_graph_proj)\n",
    "        session.execute_write(detect_community)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### To drop graph projection \n",
    "If 'articleGraph' already exists"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "WARNING:neo4j.notifications:Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated field from a procedure. ('schema' returned by 'gds.graph.drop' is deprecated.)} {position: line: 1, column: 1, offset: 0} for query: \"CALL gds.graph.drop('articleGraph')\"\n"
     ]
    }
   ],
   "source": [
    "def drop_graph_projection(tx):\n",
    "    result = tx.run(\n",
    "        \"\"\"\n",
    "    CALL gds.graph.exists('articleGraph')\n",
    "    YIELD exists\n",
    "    RETURN exists\n",
    "    \"\"\"\n",
    "    )\n",
    "    if result.single()[\"exists\"]:\n",
    "        tx.run(\"CALL gds.graph.drop('articleGraph')\")\n",
    "\n",
    "\n",
    "with GraphDatabase.driver(**NEO4J) as driver:\n",
    "    with driver.session() as session:\n",
    "        session.execute_write(drop_graph_projection)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### To get difference between networkx and neo4j "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "65"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def return_community(tx):\n",
    "    query = \"\"\"\n",
    "        MATCH (a:Article)\n",
    "        RETURN a.community AS cluster, collect(a.title) AS articles\n",
    "        ORDER BY cluster\n",
    "        \"\"\"\n",
    "    result = tx.run(query)\n",
    "    return [record for record in result]\n",
    "\n",
    "\n",
    "with GraphDatabase.driver(**NEO4J) as driver:\n",
    "    with driver.session() as session:\n",
    "        records = session.execute_read(return_community)\n",
    "\n",
    "neo4j_clusters = pd.DataFrame(\n",
    "    records, columns=[\"Cluster Number\", \"Articles in Cluster\"]\n",
    ")\n",
    "len(neo4j_clusters)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "25"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4j_clusters_grp_only = neo4j_clusters[\n",
    "    neo4j_clusters[\"Articles in Cluster\"].apply(lambda x: len(x) != 1)\n",
    "]\n",
    "len(neo4j_clusters_grp_only)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "26"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "networkx = pd.read_csv(\"../artifacts/outputs/tfidf_cosine_graph_louvain_cluster.csv\")\n",
    "networkx_grp = networkx.groupby(\"cluster_label\")[\"Page Title\"].apply(set).reset_index()\n",
    "networkx_grp_only = networkx_grp[\n",
    "    networkx_grp[\"Page Title\"].apply(lambda x: len(x) != 1)\n",
    "]\n",
    "len(networkx_grp_only)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "first = neo4j_clusters_grp_only[\"Articles in Cluster\"].to_list()\n",
    "second = networkx_grp_only[\"Page Title\"].to_list()\n",
    "\n",
    "\n",
    "def calculate_overlap(set1, set2):\n",
    "    return len(set(set1) & set(set2))\n",
    "\n",
    "\n",
    "matches = []\n",
    "matched_second_indices = set()\n",
    "\n",
    "for f_index, f_set in enumerate(first):\n",
    "    best_match = None\n",
    "    best_overlap = -1\n",
    "    best_match_index = -1\n",
    "    for s_index, s_set in enumerate(second):\n",
    "        overlap = calculate_overlap(f_set, s_set)\n",
    "        if overlap > best_overlap:\n",
    "            best_match = s_set\n",
    "            best_overlap = overlap\n",
    "            best_match_index = s_index\n",
    "    matches.append((f_set, best_match))\n",
    "    if best_match is not None:\n",
    "        matched_second_indices.add(best_match_index)\n",
    "\n",
    "# Add unmatched sets from first and second to the DataFrame\n",
    "unmatched_first = [\n",
    "    f_set for f_index, f_set in enumerate(first) if matches[f_index][1] is None\n",
    "]\n",
    "unmatched_second = [\n",
    "    s_set\n",
    "    for s_index, s_set in enumerate(second)\n",
    "    if s_index not in matched_second_indices\n",
    "]\n",
    "\n",
    "\n",
    "matched_df = pd.DataFrame(matches, columns=[\"neo4j\", \"networkx\"])\n",
    "\n",
    "# Concatenate unmatched sets\n",
    "for uf in unmatched_first:\n",
    "    matched_df = pd.concat(\n",
    "        [matched_df, pd.DataFrame([[uf, None]], columns=[\"neo4j\", \"networkx\"])],\n",
    "        ignore_index=True,\n",
    "    )\n",
    "\n",
    "for us in unmatched_second:\n",
    "    matched_df = pd.concat(\n",
    "        [matched_df, pd.DataFrame([[None, us]], columns=[\"neo4j\", \"networkx\"])],\n",
    "        ignore_index=True,\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "matched_df[\"neo4j\"] = matched_df[\"neo4j\"].apply(\n",
    "    lambda x: set(x) if str(x) != \"None\" else x\n",
    ")\n",
    "matched_df[\"Same/Different\"] = matched_df.apply(\n",
    "    lambda x: x[\"neo4j\"] == x[\"networkx\"], axis=1\n",
    ")\n",
    "\n",
    "\n",
    "def find_differences(set1, set2):\n",
    "    set1 = set1 if set1 is not None else set()\n",
    "    set2 = set2 if set2 is not None else set()\n",
    "    if set1 == set2:\n",
    "        return (\n",
    "            None,\n",
    "            None,\n",
    "        )  # Return None or an empty string if there are no differences\n",
    "    else:\n",
    "        diff1 = set1.difference(set2)\n",
    "        diff2 = set2.difference(set1)\n",
    "        return (\", \".join(diff1), \", \".join(diff2))\n",
    "\n",
    "\n",
    "matched_df[[\"Only in neo4j\", \"Only in networkx\"]] = matched_df.apply(\n",
    "    lambda x: find_differences(x[\"neo4j\"], x[\"networkx\"]), axis=1, result_type=\"expand\"\n",
    ")\n",
    "\n",
    "matched_df.to_excel(\"neo4j_networkx_cluster_comparison.xlsx\", index=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query all nodes and edges from neo4j to be plotted in pyvis"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "neo4j_network_tfidf_1.html\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n)-[r]->(m)\n",
    "RETURN n.title AS node_1, m.title AS node_2,\n",
    "        r.similarity AS edge_weight, \n",
    "       n.ground_truth AS node_1_ground_truth, \n",
    "       m.ground_truth AS node_2_ground_truth, \n",
    "       n.community AS node_1_pred_cluster, \n",
    "       m.community AS node_2_pred_cluster,\n",
    "       n.meta_desc AS node_1_meta,\n",
    "       m.meta_desc AS node_2_meta\n",
    "\"\"\"\n",
    "# nodes with no relationship\n",
    "query_2 = \"\"\"MATCH (n)\n",
    "WHERE NOT EXISTS ((n)--())\n",
    "RETURN n.title AS node_title,\n",
    "       n.ground_truth AS node_ground_truth,\n",
    "       n.community AS node_community,\n",
    "       n.meta_desc AS node_meta_desc\n",
    "\"\"\"\n",
    "with GraphDatabase.driver(**NEO4J) as driver:\n",
    "    with driver.session() as session:\n",
    "        results = session.run(query)\n",
    "        data = pd.DataFrame(results.data())\n",
    "        results_2 = session.run(query_2)\n",
    "        data_2 = pd.DataFrame(results_2.data())\n",
    "\n",
    "data[\"node_1\"] = data[\"node_1\"].astype(str)\n",
    "data[\"node_2\"] = data[\"node_2\"].astype(str)\n",
    "# data = data.dropna(subset=['node_2'])\n",
    "\n",
    "data_2[\"node_community\"] = \"\"\n",
    "\n",
    "\n",
    "# Function to visualize the result\n",
    "def visualize_result(df1, df2):\n",
    "    visual_graph = pyvis.network.Network(select_menu=True, filter_menu=True)\n",
    "\n",
    "    # Add nodes-nodes pair\n",
    "    for _, row in df1.iterrows():\n",
    "        # Add nodes\n",
    "        visual_graph.add_node(\n",
    "            row[\"node_1\"],\n",
    "            label=row[\"node_1\"],\n",
    "            title=f\"Ground Truth: {row['node_1_ground_truth']}\\nPredicted: {row['node_1_pred_cluster']}\\nMeta Description: {row['node_1_meta']}\",\n",
    "            group=row[\"node_1_pred_cluster\"],\n",
    "        )\n",
    "        visual_graph.add_node(\n",
    "            row[\"node_2\"],\n",
    "            label=row[\"node_2\"],\n",
    "            title=f\"Ground Truth: {row['node_2_ground_truth']}\\nPredicted: {row['node_2_pred_cluster']}\\nMeta Description: {row['node_2_meta']}\",\n",
    "            group=row[\"node_2_pred_cluster\"],\n",
    "        )\n",
    "\n",
    "        # Add edge\n",
    "        visual_graph.add_edge(\n",
    "            row[\"node_1\"], row[\"node_2\"], title=f\"Edge Weight: {row['edge_weight']}\"\n",
    "        )\n",
    "\n",
    "    # Add solo nodes\n",
    "    for _, row in df2.iterrows():\n",
    "        visual_graph.add_node(\n",
    "            row[\"node_title\"],\n",
    "            label=row[\"node_title\"],\n",
    "            title=f\"Ground Truth: {row['node_ground_truth']}\\nPredicted: No Community\\nMeta Description: {row['node_meta_desc']}\",\n",
    "        )\n",
    "    visual_graph.show(\"neo4j_network_tfidf_1.html\", notebook=False)\n",
    "\n",
    "\n",
    "visualize_result(data, data_2)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
